import numpy as np

# 大拇指、食指、中指、无名指、小拇指指尖在WebXR中的索引
tip_indices = [4, 9, 14, 19, 24]

# open television原始齐次矩阵，用作坐标系基变换
# WebXR原始坐标系为右手系，Y轴向上，X轴向右，Z轴向后，如下：
#       Y | 
#         |
#         |__ __X
#        /
#     Z / 
#
# isaaclab中坐标系为右手系，X轴向前，Y轴向左，Z轴向上，如下：
#       Z |  / X
#         | /
#  Y __ __|/
#      
grd_yup2grd_zup = np.array([[0, 0, -1, 0],
                            [-1, 0, 0, 0],
                            [0, 1, 0, 0],
                            [0, 0, 0, 1]])


# open television原始齐次矩阵，用作双手腕部URDF模型坐标系到WebXR腕部坐标系的转换
hand2inspire = np.array([[0, -1, 0, 0],
                         [0, 0, -1, 0],
                         [1, 0, 0, 0],
                         [0, 0, 0, 1]])


# 双手(OY)腕部USD模型坐标系到WebXR腕部坐标系的转换，XYZ顺序下(0,1.57,0)
# WebXR坐标系中双手初始状态(roll:0,pitch:0,yaw:0)下，X轴向下，Y轴向左，Z轴向前，如下：   
#           / Z
#  Y __ __ /
#         |
#         | X
#              
# OY双手初始状态(roll:0,pitch:0,yaw:0)下，X轴向前，Y轴向左，Z轴向上，如下：
#       Z |  / X
#         | /
#  Y __ __|/
hand_vr2urdf = np.array([[0, 0, 1, 0],
                        [0, 1, 0, 0],
                        [-1, 0, 0, 0],
                        [0, 0, 0, 1]])


# 由于装配体中双手绕自身Z轴旋转了110度，因此除hand_vr2urdf之外还需要额外绕Z轴旋转110度
# XYZ顺序下(0,1.57,1.9188)
hand_vr2urdf_dc = np.array([[0, 0, 1, 0],
                        [0.9396926, -0.3420202,  0.0000000, 0],
                        [0.3420202,  0.9396926, -0.0000000, 0],
                        [0, 0, 0, 1]])

# WebXR中双眼默认姿态为(roll:0,pitch:0,yaw:0)，不便于操作，因此转换为(roll:0,pitch:0.785,yaw:0)
head_vr2urdf = np.array([[0.7071068,  0.0000000,  0.7071068, 0],
                        [0.0000000,  1.0000000,  0.0000000, 0],
                        [-0.7071068,  0.0000000,  0.7071068, 0],
                        [0, 0, 0, 1]])

